#include <iostream>

using namespace std;

int main()
{
    for (int i = 1; i <= 100; i++)
    {
        if (i % 10 == 7 || i / 10 == 7 || i % 7 == 0)
        {
            cout << "敲桌子"
                 << " ";
        }
        else
        {
            cout << i << " ";
        }
    }
    cout << endl;

    /*
        1 2 3 4 5 6 敲桌子 8 9 10 11 12 13 敲桌子 15 16 敲桌子 18 19 20 敲桌子 22 23 24 25 26 敲桌子 敲桌子 29 30 31 32 33 34 敲桌子 36 敲桌子 38 39 40 41 敲桌子 43 44 45 46 敲桌子 48 敲桌子 50 51 52 53 54 55 敲桌子 敲桌子 58 59 60 61 62 敲桌子 64 65 66 敲桌子 68 69 敲桌子 敲桌子 敲桌子 敲桌子 敲桌子 敲桌子 敲桌子 敲桌子 敲桌子 敲桌子 80 81 82 83 敲桌子 85 86 敲桌子 88 89 90 敲桌子 92 93 94 95 96 敲桌子 敲桌子 99 100
    */

    return 0;
}